import './Footer.css';

export const Footer=()=>{
    return(

        <footer className='scr' id='title4'>
            <span>©NurAnime 2022</span>
            <p>Японское аниме - самое великое искусство анимации, имеющею самую большую армию фанатов в мире. 
                На сайте ©NurAnime представлены аниме которые мне понравились, те которые я не смотрел - я и не выкладываю. 
                Так что доверьтесь моему вкусу, и обязательно посмотрите все представлены аниме-сериалы.
            </p>
        </footer>
        
    )
}

export default Footer;