import React from "react"
export const database_movies =[
    {
        img1:"https://avatanplus.com/files/resources/original/5a6aac33c2db916130b0aa56.png",
        img2:"https://avatanplus.com/files/resources/original/5e25865a6741816fc294d137.png",
        img:"https://thumbs.dfs.ivi.ru/storage9/contents/d/6/04d8a262e7224a2a624cbda013b896.jpg",
        year:2016,
        name:'Поезд в Пусан',
        description:'У маленькой Су-ан день рождения. Девочка живет с отцом в Сеуле и очень хочет отправиться к маме в Пусан. По дороге случается непредвиденное, и на страну обрушивается загадочный вирус. Пассажирам поезда в Пусан — единственного города, отразившего атаки вируса — придется бороться за выживание. 442 километра в пути. Добро пожаловать на борт и помните — в этой гонке недостаточно выжить, чтобы остаться человеком.',
        html_code:<iframe title="1" src="//kodik.cc/video/10164/e93b27a9c97d0f096656e1743f53f1e8/720p" className='mov' width="99%" 
        height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://funart.pro/uploads/posts/2019-09/thumbs/1569090959_tvoe-imja-anime-7.jpg",
        name:'Твоё имя',
        year:2016,
        description:'А вы любите спать? 99% людей скажут что да, ведь во время сна мы отдыхаем, а ещё нам снятся сладкие сны… Или кошмары от которых хочется проснуться. Двое подростков, Таки и Мицуха живут далеко друг от друга, никогда не виделись и не знали об существовании друг друга, пока в один прекрасный момент не поменялись телами. Магия? Волшебство? Или просто сон!? Но теперь им придется жить на две жизни, за себя и за того парня как говорится. Смогут ли молодые люди не разрушить свою жизнь, ведь мальчики и девочки отличаются не только физиологией, но и образоммыслей и характерами. Вот только возможно это только сон, и они даже не вспомнят даже имени друг друга после пробуждения',
        html_code:<iframe  src="//aniqit.com/video/34204/89e3a2101a462afdb31f28d133a32880/720p" width="99%"  className='mov'
        height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://darklibria.it/upload/release/350x500/9002.jpg",
        name:'Клинок, рассекающий демонов: Бесконечный поезд',
        year:2020,
        description:'Сразу после не очень приятного знакомства со старшими истребителями и последующего лечения,Танзиро, Зеницу и Иноске отправились на свое следующее задание. Правда на этот раз не одни,а в компании все тех же столпов, а точнее одного из них, - пламенного Ренгоку. Очевидно,  работенка и в этот раз предстоит далеко не простая, раз в деле оказался замешан один из Двенадцати демонических лун, Энму. Неужели байка про бесконечный поезд не сказка?!',
        html_code:  <iframe src="//aniqit.com/video/73752/236bc90f513b872dfc7985d8cd7a6522/720p" width="99%" className='mov'
        height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://upload.wikimedia.org/wikipedia/ru/4/4d/The_Witcher_Nightmare_of_the_Wolf.jpg",
        name:'Ведьмак: Кошмар волка',
        year:2021,
        description:'Веcемир вырвался из нищеты и стал ведьмаком. Теперь он убивает монстров за монету и славу. Но приходит новый враг, и Весемиру придется столкнуться с демонами своего прошлого.',
        html_code: <iframe src="//kodik.cc/video/77354/77e0e4f984951d6b08a96c3830d76171/720p" width="99%" 
        height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://static.okko.tv/images/v2/8746610?scale=1&quality=80",
        name:'гангстер коп и дьявол',
        year:2019,
        description:'2005 год. Криминальный босс провинциального города Чхонан Чан Дон-су подвергается нападению серийного убийцы и оказывается единственной выжившей жертвой. Репутация подмочена, единственный способ восстановить авторитет в глазах братвы — найти нападавшего и отомстить. Местный детектив Чон Тхэ-сок всей своей полицейской душой ненавидит организованную преступность, но ему приходится объединить силы с бандитом Дон-су, чтобы изловить ещё более ненавистного маньяка.',
        html_code:<iframe width="99%" height="99%" src="https://www.youtube.com/embed/u-bo9fK9Zpo" 
        title="Гангстер, коп и дьявол (Фильм 2019) Боевик, криминал, триллер" 
        frameborder="0" allowfullscreen allow="autoplay *; fullscreen *" 
        ></iframe>
    },
    {
        img:"https://upload.wikimedia.org/wikipedia/ru/d/de/%D0%9F%D0%BE%D0%B5%D0%B7%D0%B4_%D0%B2_%D0%9F%D1%83%D1%81%D0%B0%D0%BD_2_%D0%9F%D0%BE%D0%BB%D1%83%D0%BE%D1%81%D1%82%D1%80%D0%BE%D0%B2.jpg",
        name:'Поезд в Пусан 2',
        year:2020,
        description:' Продолжается история зомби-апокалипсиса поразившего Южную Корею. Действия разворачиваются после четырех лет с момента вспышки зомби-вируса, и рассказывают о группе уцелевших людей пытающихся выжить на полуострове, кишащем ходячими мертвецами. Они смогли пережить поезд в Пусан, но полуостров станет для храбрецов еще большим испытанием….',
        html_code: <iframe src="https://red.uboost.one/view/e4ddeac60ea001c63fb7fa9ce27a77c0/27170" width="99%" 
        height="99%" border="0" frameborder="0" allowfullscreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/aae3a928-6465-4bed-9af4-16929a44fd79/600x900",
        name:'Паразиты',
        year:2019,
        description:'Обычное корейское семейство Кимов жизнь не балует. Приходится жить в сыром грязном полуподвале, воровать интернет у соседей и перебиваться случайными подработками. Однажды друг сына семейства уезжая на стажировку за границу, предлагает тому заменить его и поработать репетитором у старшеклассницы в богатой семье Пак. Подделав диплом о высшем образовании, парень отправляется в шикарный дизайнерский особняк и производит на хозяйку дома хорошее впечатление.Тут же ему в голову приходит необычный план по трудоустройству сестры.',
        html_code:<iframe src="//kodik.cc/video/41167/4509cc271da1e4cb695ed0bede4aeeb4/720p" 
        width="99%" height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://www.film.ru/sites/default/files/movies/posters/50316027-2242934.jpg ",
        name:'Пурпурные сердца',
        year:2022,
        description:'Молодая певица соглашается на фиктивный брак с морпехом, который готовится к предстоящей службе, но трагедия приводит к тому, что между ними появляются настоящие чувства.',
        html_code:<iframe src="https://tempt.as.alloeclub.com/?token_movie=d8ca5147c29b49d5352a748f0c5d37&amp;token=c3e2744a3499a6886d5e403f6184fe" 
        width="99%" height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://www.film.ru/sites/default/files/movies/posters/49435972-1723188.jpg",
        name:'Человек-паук: Нет пути домой',
        year:2021,
        description:'Что может быть лучше человек-паука? Только кроссовер из ТРЁХ человеков-пауков!',
        html_code: <iframe name="film_main" id="film_main" src="https://tempt.as.alloeclub.com/?token_movie=0db06d820a3aa69c0d2dd0b02484ff&amp;token=c3e2744a3499a6886d5e403f6184fe" width="99%"
        height="99%" frameborder="0" AllowFullScreen allow="autoplay *; fullscreen *"></iframe>
    },
    {
        img:"https://thumbs.dfs.ivi.ru/storage8/contents/a/f/d68ca412f7908b21d63eeb340ea84d.jpg",
        name:'новый человек паук высокое напряжение',
        year:2014,
        description:'Фильм Новый новый человек паук высокое напряжениеЧеловек-паук: Высокое напряжение 2014 смотреть онлайн в хорошем качестве можно на киного бесплатно. Остросюжетная кинолента «Новый Человек-паук: Высокое напряжение» продолжает повествовать историю Питера Паркера, на долю которого выпала честь стать чудным паучком спасающим человечество. Питер пытается совместить супергеройскую жизнь, учебу и личные отношения, но получается это у него очень плохо. Но вскоре эти проблемы отходят на второй план, ведь в городе появился новый суперзлодей Электро, способный стереть с лица земли Нью-Йорк, в мгновение ока. Питеру, так же известному как новый Человек-паук, предстоит обуздать высокое напряжение и остановить Электро, иначе в мире воцарится хаос....',
        html_code:<iframe width="99%" height="99%" src="//red.uboost.one/view/e4ddeac60ea001c63fb7fa9ce27a77c0/5288" 
        frameborder="0" allowfullscreen=""></iframe>
    },
    {
        img:"https://media.kg-portal.ru/movies/s/spiderman3d/posters/spiderman3d_20.jpg",
        name:'Новый человек паук',
        year:2012,
        description:' В остросюжетной киноленте «Новый Человек-паук» повествуется история появления супергероя. Главный герой вовсе не брутальный мускулистый мужчина вселяющий страх в сердца преступников одним своим видом, а всего лишь молодой смазливый паренек, одетый в латексный костюм милого паучка. Теперь по порядку, зовут его Питер Паркер, и он не всегда был наделен суперсилой, а получил ее при укусе генетически модифицированного паука. Пытаясь разобраться с взвалившейся на него силой, он обращается за помощью к старому другу отца, генетику Курту Коннорсу. Вместе они дорабатывают формулу способную регенерировать человеческий организм, и профессор Коннорс испытывает ее на себе, тем самым превращается в злобного ящера. Теперь Питер он же новый Человек-паук должен остановить своего наставника, пока не произошло что-то ужасное.',
        html_code: <iframe width="99%" height="99%" src="//red.uboost.one/view/e4ddeac60ea001c63fb7fa9ce27a77c0/4596" 
        frameborder="0" allowfullscreen=""></iframe>,
     
    },
]